In [ ]:
import pandas as pd
data={'Name':['Alice','Bob','Charlie'],'Age':[25,30,35],'Salary':[50000,60000,70000]}
df=pd.DataFrame(data)
print(df)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000

In [ ]:
new_rows=[{'Name':'David','Age':28,'Salary':80000},{'Name':'Eva','Age':22,'Salary':55000},{'Name':'Philip','Age':45,'Salary':40000},{'Name':'Joan','Age':23,'Salary':75000}]
for row in new_rows:
  df=df.append(row,ignore_index=True)
print(df)

       Name  Age  Salary
0     Alice   25   50000
1       Bob   30   60000
2   Charlie   35   70000
3     David   28   80000
4       Eva   22   55000
5    Philip   45   40000
6      Joan   23   75000
7     David   28   80000
8       Eva   22   55000
9    Philip   45   40000
10     Joan   23   75000

<ipython-input-6-db0b4f65efad>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)
<ipython-input-6-db0b4f65efad>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)
<ipython-input-6-db0b4f65efad>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)
<ipython-input-6-db0b4f65efad>:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df=df.append(row,ignore_index=True)

In [ ]:
print("\nFirst Five Rows")
print(df.head())

First Five Rows
      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   28   80000
4      Eva   22   55000

In [ ]:
print("\nTail")
print(df.tail())

Tail
      Name  Age  Salary
6     Joan   23   75000
7    David   28   80000
8      Eva   22   55000
9   Philip   45   40000
10    Joan   23   75000

In [ ]:
print("\nCount")
print(df.count())

Count
Name      11
Age       11
Salary    11
dtype: int64

In [ ]:
print("\nSum")
print(df['Age'].sum(),df['Salary'].sum())

Sum
326 680000

In [ ]:
print(df.describe())

             Age        Salary
count  11.000000     11.000000
mean   29.636364  61818.181818
std     8.558887  15045.385883
min    22.000000  40000.000000
25%    23.000000  52500.000000
50%    28.000000  60000.000000
75%    32.500000  75000.000000
max    45.000000  80000.000000

In [ ]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    11 non-null     object
 1   Age     11 non-null     int64
 2   Salary  11 non-null     int64
dtypes: int64(2), object(1)
memory usage: 392.0+ bytes
None

In [ ]:
print(df.isnull().sum())

Name      0
Age       0
Salary    0
dtype: int64

In [ ]:
print("Mean of age:",df['Age'].mean())
print("Mean of salary:",df['Salary'].mean())

Mean of age: 29.636363636363637
Mean of salary: 61818.181818181816

In [ ]:
print("Median of age:",df['Age'].median())
print("Median of salary:",df['Salary'].median())

Median of age: 28.0
Median of salary: 60000.0

In [ ]:
print(df.mode())

     Name  Age  Salary
0   David   22   40000
1     Eva   23   55000
2    Joan   28   75000
3  Philip   45   80000

In [ ]:
print("Standard Deviation of values: ",df['Age'].std(),df['Salary'].std())

Standard Deviation of values:  8.558886928482316 15045.3858828425

In [ ]:
print("Minimum Age and Salary",df['Age'].min(),df['Salary'].min())

Minimum Age and Salary 22 40000

In [ ]:
print("Maximum Age and Salary",df['Age'].max(),df['Salary'].max())

Maximum Age and Salary 45 80000

In [ ]:
print(df.min())

Name      Alice
Age          22
Salary    40000
dtype: object

In [ ]:
print(df.max())

Name      Philip
Age           45
Salary     80000
dtype: object